/*
* 功能: website 异常用例，单元测试
*
* 测试用例：- 涉及功能
* 1. 增
* 2. 删
* 3. 改
* 4. 查
* 5. 批量增
* 6. 批量删
* 7. 批量改
* 8. 批量查
*
* 测试用例：- 涉及异常操作
 1. 空
    - 单个值
    - 多个值
 2. 空格
    - 单个值
    - 多个值
 3. 特殊字符
    - 单个值
    - 多个值
 4. 过长
    - 单个值
    - 多个值
 5. 带单引号或双引号
    - 单个值
    - 多个值
 6. 带双引号
    - 单个值
    - 多个值
 7. 参数过多或过少
    - 过多
    - 过少
 8. 非指定类型
    - int -> string float bool
    - float -> string float bool
    - string -> int float bool
    - bool -> string float bool

* 所有方法思路

 1. 清空表

 2. 添加数据

 3. 增删改查、批量增删改查

 4. 检测

    文件分区

- 变量 分区
- 测试函数 分区
- 被调用函数 分区
*/
package db

// ---------------------------- 变量 start ----------------------------
// var weded_dwe = 1

// ---------------------------- 变量 end ----------------------------

// ---------------------------- 测试函数 start ----------------------------

// ---------------------------- 测试函数 end ----------------------------

// ---------------------------- 被调用函数 start ----------------------------

// ---------------------------- 被调用函数 end ----------------------------
